laboratorio-2-jmalvarezbesa.git/app/controllers/courses_controller.rb

SELECT "courses".* FROM "courses" WHERE "courses"."title" = ?  [["title", "3"]]
SELECT "courses".* FROM "courses"
---
  def index
    @q = params[:q]
    if @q == ""
      @q = nil
    end
    if @q
      @courses = Course.where(:title => @q)
    else
      @courses = Course.all

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "student_courses".* FROM "student_courses" WHERE "student_courses"."course" = ?  [["course", "2"]]
---
  def show
    @student_courses = StudentCourse.where(:Course => Course.find(params[:id]))

INSERT INTO "courses" ("title", "code", "Person_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "termodinamica"], ["code", 1], ["Person_id", 1], ["created_at", 2017-03-26 19:23:49 UTC], ["updated_at", 2017-03-26 19:23:49 UTC]]
---
  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_course
      @course = Course.find(params[:id])