laboratorio-2-jmalvarezbesa.git/app/controllers/student_courses_controller.rb

  def index
    @student_courses = StudentCourse.all
---
SELECT "student_courses".* FROM "student_courses"

  def create
    @student_course = StudentCourse.new(student_course_params)

    respond_to do |format|
      if @student_course.save
---
INSERT INTO "student_courses" ("Person_id", "Course_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["Person_id", 4], ["Course_id", 1], ["created_at", 2017-03-26 19:28:19 UTC], ["updated_at", 2017-03-26 19:28:19 UTC]]

    def set_student_course
      @student_course = StudentCourse.find(params[:id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "student_courses".* FROM "student_courses" WHERE "student_courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]